---
title: ApplicationEntryPoint
classe: Autodesk.Revit.DB.Macros.ApplicationEntryPoint
namespace: Autodesk.Revit.DB.Macros
eredita: Autodesk.Revit.ApplicationServices.Application
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# ApplicationEntryPoint

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String AddinFolder { get; }` | `applicationEntryPoint.AddinFolder` | String |
| `Void FinishInitializationEO()` | `applicationEntryPoint.FinishInitializationEO()` | Void |
| `Void Initialize(Object, String)` | `applicationEntryPoint.Initialize(obj, addinFolder)` | Void |
| `Void OnShutdownEO()` | `applicationEntryPoint.OnShutdownEO()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```